# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [35]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [36]:
series1 = pd.Series(np.random.randint(1, 5, 100))
series2 = pd.Series(np.random.randint(1, 4, 100))
series3 = pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [37]:
df = pd.concat([series1, series2, series3], axis=1)
df

    0  1      2
0   2  3  16260
1   2  3  20297
2   2  2  21868
3   4  3  14577
4   2  3  12752
.. .. ..    ...
95  4  3  13921
96  1  2  23956
97  3  1  29735
98  4  1  18609
99  4  2  14973

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [38]:
# df = pd.concat([series1, series2, series3], axis=1, keys=["bedrs", "bathrs", "price_sqr_meter"])
# df

In [39]:
df = df.rename(columns={0:"bedrs", 1:"bathrs", 2:"price_sqr_meter"})
df

    bedrs  bathrs  price_sqr_meter
0       2       3            16260
1       2       3            20297
2       2       2            21868
3       4       3            14577
4       2       3            12752
..    ...     ...              ...
95      4       3            13921
96      1       2            23956
97      3       1            29735
98      4       1            18609
99      4       2            14973

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [50]:
bigcolumn = pd.DataFrame(pd.concat([series1, series2, series3], axis=0))
bigcolumn

        0
0       2
1       2
2       2
3       4
4       2
..    ...
95  13921
96  23956
97  29735
98  18609
99  14973

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [41]:
# False

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [56]:
bigcolumn = bigcolumn.reset_index(drop=True)
bigcolumn

         0
0        2
1        2
2        2
3        4
4        2
..     ...
295  13921
296  23956
297  29735
298  18609
299  14973

[300 rows x 1 columns]